<?php

namespace Database\Seeders;

use App\Models\Blog;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BlogSeeder extends Seeder
{

    public $blogs = [
        [
            'title' => 'حليل أحدث الاتجاهات في عالم السيارات: دليلك لأحدث الطرازات والتقنيات',
            'short_description' => ' استكشف أحدث أخبار صناعة السيارات وتقنياتها، وتعرّف على أحدث الطرازات والابتكارات التي تهم السائقين اليوم',
            'description' => 'يعد هذا المدونة مصدرًا موثوقًا لمتابعة آخر الابتكارات والتطورات في عالم السيارات. ستجد هنا تحليلات معمقة لأحدث الطرازات، بالإضافة إلى تغطية شاملة للتقنيات الجديدة المستخدمة في تصنيع السيارات. سواء كنت مهتمًا بالسيارات الكهربائية، أو السيارات ذاتية القيادة، أو التصميم الداخلي والخارجي، فإن هذه المدونة توفر لك كل ما تحتاج لمواكبة التطورات الحديثة في عالم السيارات.',
            'author' => 'محمد',
            'category' => 'سيارات',
            'image' => 'assets/images/blog/1.jpg',
        ],
        [
            'title' => 'رحلة في عالم السيارات الكلاسيكية: استكشاف تاريخ وتراث السيارات الأسطورية',
            'short_description' => ' انغمس في عالم السيارات الكلاسيكية واستمتع بجولة فريدة من نوعها في تاريخ وتراث السيارات الأسطورية.',
            'description' => 'يأخذك هذا المدونة في رحلة ساحرة إلى عالم السيارات الكلاسيكية، حيث يمكنك استكشاف جماليات التصميم والأداء من خلال تاريخ السيارات الأسطورية. ستجد هنا تقارير مفصلة عن الطرازات التاريخية الشهيرة، بالإضافة إلى قصص شيقة حول أصحابها والأحداث التي شهدتها. سواء كنت مهتمًا بتاريخ ماركات معينة أو بسحر السيارات الفاخرة، فإن هذه المدونة تقدم لك فرصة لاكتشاف الجمال الأبدي للسيارات الكلاسيكية.',
            'author' => 'احمد',
            'category' => 'سيارات',
            'image' => 'assets/images/blog/2.jpg',
        ],
        [
            'title' => 'مستقبل القيادة الذاتية: تحليل أخبار التقنيات والتطورات في مجال السيارات الذكية',
            'short_description' => 'تعرف على أحدث التطورات في مجال القيادة الذاتية والسيارات الذكية، وكيف تؤثر على مستقبل النقل.',
            'description' => 'تتبع هذه المدونة التطورات الرئيسية في مجال القيادة الذاتية والسيارات الذكية، من التقنيات الحالية إلى الابتكارات المستقبلية. ستجد هنا تحليلات مفصلة للأنظمة الذكية المتقدمة والاختبارات الميدانية، بالإضافة إلى مناقشات حول التحديات القانونية والأخلاقية التي تواجه هذه التقنيات المتطورة. سواء كنت تبحث عن فهم أفضل لكيفية عمل السيارات الذكية أو عن تقييم للمخاطر والفوائد المحتملة للقيادة الذاتية، فإن هذه المدونة هي المصدر المثالي للمعرفة.',
            'author' => 'محمود',
            'category' => 'سيارات',
            'image' => 'assets/images/blog/3.jpg',
        ],
        [
            'title' => 'الابتكارات البيئية في صناعة السيارات: استدامة وتقنيات نظيفة للمستقبل',
            'short_description' => 'اكتشف كيف تعمل صناعة السيارات على تحسين الأداء البيئي من خلال الابتكارات والتكنولوجيا النظيفة.',
            'description' => ' تسلط هذه المدونة الضوء على الجهود المبذولة في صناعة السيارات لتحسين أثرها البيئي وتعزيز الاستدامة. من السيارات الكهربائية إلى الوقود البديل وتقنيات الإنتاج النظيف، ستجد هنا تقارير شاملة عن أحدث الابتكارات التي تسعى للحفاظ على البيئة وتقليل الانبعاثات الضارة. كما تقدم المدونة نقاشات حول التحديات التي تواجه تبني التقنيات البيئية في الصناعة، وكيف يمكن للمستهلكين المساهمة في هذه الجهود من خلال اتخاذ قرارات استهلاكية مدروسة.',
            'author' => 'مصطفى',
            'category' => 'مدونة',
            'image' => 'assets/images/blog/4.jpg',
        ],
    ];

    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // Blog::factory(6)->create();

        foreach ($this->blogs as $blog) {
            Blog::create($blog);
        }


    }
}
